{
  "entries": [
    {
      "date": "15 jan, 2026",
      "date_slug": "15_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280315",
      "content": [
        {
          "type": "text",
          "content": "Golum adn orb cont….."
        },
        {
          "type": "text",
          "content": "Feel like puking tomorrow I'll be offline wake up early and not talk to anyone imma be chilling no fomo we good we the best music"
        },
        {
          "type": "text",
          "content": "# 23 jan, 2026"
        },
        {
          "type": "text",
          "content": "feeling exactly like how i used to feel when i read munshi premchand and co. as a kid from my hindi textbook before the term aktually started and shit sometimes caught me existential as 12 yo ngl"
        },
        {
          "type": "text",
          "content": "yeah the english literature also hit sure but the hindi literature described things that i had either experienced sometimes or can see it happening in some village near me. or got me feeling nostalgia of things i never experienced. the thing is i dont remember most of those stories but i remember exactly how i felt reading those and it was like this. even the after taste."
        },
        {
          "type": "text",
          "content": "weird tho cause i haevnt felt like this in atleast 6 years"
        },
        {
          "type": "text",
          "content": "listening to kanye and tyler the creator while thikning about life and studying up simd architecture adn how to optimise operations feels pretty good to understand something deeply and not worry about what came before or after. oh read freiren's manga too, so everything im feeling is teh culmination of that."
        },
        {
          "type": "text",
          "content": "Doing things while being absorbed nowadays i also remember feeling like this while i went to a school named oxford from my school and their auditorium was pretty good and they served some snacks too, i went there for some competition it was pretty nice."
        },
        {
          "type": "text",
          "content": "Anyways as to what im doing nowadays im optimising this anthropics assignment to surpass the limit of opus as well as myself"
        },
        {
          "type": "text",
          "content": "This is the link if anyone else wants to try [https://github.com/anthropics/original_performance_takehome](https://github.com/anthropics/original_performance_takehome)"
        },
        {
          "type": "text",
          "content": "im also learning kernel optimizations too while doing adn it has been a good experience so far but i wanna finish it on a good note. Lemme see what i can do."
        },
        {
          "type": "text",
          "content": "Also writing an article on my learning will publish it :D"
        }
      ]
    },
    {
      "date": "14 jan, 2026",
      "date_slug": "14_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280306",
      "content": [
        {
          "type": "text",
          "content": "Golum"
        },
        {
          "type": "text",
          "content": "And orb"
        }
      ]
    },
    {
      "date": "13 jan, 2026",
      "date_slug": "13_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280248",
      "content": [
        {
          "type": "text",
          "content": "Umm here is the launch of canvas btw got some users also a lot to improve tbh but dont feel liek it as of now [https://x.com/kucchi09/status/2010270871366316051?s=20](https://x.com/kucchi09/status/2010270871366316051?s=20)"
        },
        {
          "type": "text",
          "content": "Anyways now until the next idea or inspiration or burst of energy i will be studying system design"
        },
        {
          "type": "text",
          "content": "Also whats more is that i wont be optimising for anything now and im just gonna study for a bit, cause a bit tired of building."
        },
        {
          "type": "text",
          "content": "Ok i wanna get out of here and feel whatever ts is but for boys"
        },
        {
          "type": "image",
          "src": "images/blog/13_jan_2026_kix.oety.png"
        },
        {
          "type": "text",
          "content": "I felt ts as a kid during diwali but havent felt ts in so long"
        },
        {
          "type": "image",
          "src": "images/blog/13_jan_2026_kix.ml5h.png"
        }
      ]
    },
    {
      "date": "11 jan, 2026",
      "date_slug": "11_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280218",
      "content": [
        {
          "type": "image",
          "src": "images/blog/11_jan_2026_kix.mp0v.png"
        }
      ]
    },
    {
      "date": "8 jan, 2026",
      "date_slug": "8_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280134",
      "content": [
        {
          "type": "text",
          "content": "Well this hibernation was fun but i gotta workout also :D"
        },
        {
          "type": "image",
          "src": "images/blog/8_jan_2026_kix.luex.png"
        },
        {
          "type": "text",
          "content": "Umm canvas works now"
        },
        {
          "type": "image",
          "src": "images/blog/8_jan_2026_kix.g3i9.png"
        },
        {
          "type": "text",
          "content": "So much work to do  but ionn wanna do shit fuck you need to go running i think"
        }
      ]
    },
    {
      "date": "7 jan, 2026",
      "date_slug": "7_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280101",
      "content": [
        {
          "type": "text",
          "content": "hi today I'll try to workout and absolutely spam codeforces (in a good way) been a long long while since I've touched codeforces and now it's time"
        },
        {
          "type": "text",
          "content": "ps: went into another rabbithole instead of ts"
        },
        {
          "type": "text",
          "content": "There is this feeling that im chasing its when you try something new those evenings they are really fun the aesthetics i cant quite describe but its really fun all those connections forming in your brain and trying to connect it to all youve learnt before and unlearn some things its really fun."
        },
        {
          "type": "text",
          "content": "btw ts wen I was looking at the jaeger repo of cncf which is like a traceability software and also I streamed today btw it's like 1:25 am and I should sleep, the plan for tomorrow is to continue understand this jaeger repo and maybe also see how it works wit other tools such as Prometheus etc also see if I can contribute to it I mean it will require effort but should be doable and if I like it then might also apply for ts cncf mentorship thing but either way it's good learning so I don't mind."
        },
        {
          "type": "text",
          "content": "Also watches ts camping anime and it reminded me of the time I camped in kullu. I think camping will be my hobby I wanna camp in Japan too btw aa well as in chandratal in India and there should be other places too jaise anywhere where I can see fireflies."
        },
        {
          "type": "text",
          "content": "Btw the plan for tomorrow is to"
        },
        {
          "type": "text",
          "content": "wake up and do some codeforces or system design"
        },
        {
          "type": "text",
          "content": "make sense of jaeger"
        },
        {
          "type": "text",
          "content": "stream advent of code in go"
        },
        {
          "type": "text",
          "content": "work on your side project if you want"
        },
        {
          "type": "text",
          "content": "😼😼"
        },
        {
          "type": "text",
          "content": "I should have fun while living my life either way. I win either way."
        },
        {
          "type": "text",
          "content": "But yeah in a few years must get to a place where I just do things and chase aesthetics that are uniquely mine and don't have to worry about money at all it's just smth that's there ykwim."
        },
        {
          "type": "text",
          "content": "anyways should sleep now gnight"
        }
      ]
    },
    {
      "date": "6 jan, 2026",
      "date_slug": "6_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280088",
      "content": [
        {
          "type": "text",
          "content": "Hey i should start the day with doing the difficult thing and getting it out of the way and for me rn that is system design in go so gotta do that(cause gotta look up some syntax sometimes)"
        },
        {
          "type": "text",
          "content": "Done solving :D but i still wanna do more after a bit"
        },
        {
          "type": "text",
          "content": "Need to meditate and to let go of all fomo adn realise that i have enough but tbh ts is all bs you aktually need to spend your time/days in a way that they look peak yk. You need to do peak work not fucking mediocre work do peak work :D"
        }
      ]
    },
    {
      "date": "5 jan, 2026",
      "date_slug": "5_jan_2026",
      "timestamp": "2026-02-02T10:34:20.280003",
      "content": [
        {
          "type": "text",
          "content": "So the plan for today is to do codeforces or system design during the day and then work on my projects during the night after making myself some real good coffee :D"
        },
        {
          "type": "text",
          "content": "And will think here for my projects"
        },
        {
          "type": "text",
          "content": "Hmm so now i coded up a fraud_detection system in go :D"
        },
        {
          "type": "text",
          "content": "The struct i used is one thing ive noticed is in system design oas if you figure out the initial struct then the rest becomes kinda doable. So the struct for this was"
        },
        {
          "type": "text",
          "content": "type merchant struct {"
        },
        {
          "type": "text",
          "content": "id                string"
        },
        {
          "type": "text",
          "content": "fraudTransactions map[string]int"
        },
        {
          "type": "text",
          "content": "totalTransactions map[string]int"
        },
        {
          "type": "text",
          "content": "isFraud           bool"
        },
        {
          "type": "text",
          "content": "}"
        },
        {
          "type": "text",
          "content": "And then a map of merchants[id] = *merchant :D"
        },
        {
          "type": "text",
          "content": "One step at a time pls you might not get where you want to at once. But slowly and surely just keep picking the next best thing adn you’ll make it. And remember be kind to yourself and take care of yourself none of it really matters if you arent loving and"
        },
        {
          "type": "text",
          "content": "Need an obsession smth that i can give myself to something that i can level up on craz and put other things on the sideline need smth that can take me in i  have all this creative energy that needs to go somewhere"
        },
        {
          "type": "text",
          "content": "Intent <-> llm/ml architecture that is yet to come (this intent is transmitted via could be sketching/text/me speaking) <-> code/object/model(3d/2d) (it gets validated by real world physics constraints/ it should be 3d printable) (iteration loop) -> real world object or lets it can 3d printed"
        },
        {
          "type": "text",
          "content": "V1 of this project /research/ basically making the system design"
        },
        {
          "type": "text",
          "content": "Update: i was able to do it gnight"
        },
        {
          "type": "image",
          "src": "images/blog/5_jan_2026_kix.5yb1.png"
        }
      ]
    },
    {
      "date": "4 jan, 2026",
      "date_slug": "4_jan_2026",
      "timestamp": "2026-02-02T10:34:20.279919",
      "content": [
        {
          "type": "text",
          "content": "In halki halki dhoop with my mac and notebook and airpods will update with what i do here :D"
        },
        {
          "type": "text",
          "content": "(hoping the dhoop stays enough so i dont have to go indoors)"
        },
        {
          "type": "text",
          "content": "Fuck dhoop chali gayi smh"
        },
        {
          "type": "text",
          "content": "What do you want from life? What do you want from the next 6 months? Anything specific you feel like doing or just staying the same? A bunch of nothing making so many moves in all direction that you end up not far from where you are rn. I would like to have this convo again but from a different place not where im at now. Is the goal a better job? Or smth of your own? Or idk could be anything. Is it to be particularly competent and one thing or to be"
        },
        {
          "type": "text",
          "content": "<Later in evening>"
        },
        {
          "type": "text",
          "content": "Anyways here is some of the things that i wanted to do as a kid and even now"
        },
        {
          "type": "text",
          "content": "Run in peak form on a track like this at night for as many days as i can"
        },
        {
          "type": "image",
          "src": "images/blog/4_jan_2026_kix.ssyu.png"
        },
        {
          "type": "text",
          "content": "Swim at night in a blue lit pool (checked but i wanna do it more)"
        },
        {
          "type": "image",
          "src": "images/blog/4_jan_2026_kix.ngcm.png"
        },
        {
          "type": "text",
          "content": "Play football at night in peak form on a well maintained ground with good grass with friends and have good food after taking a hot shower :D"
        },
        {
          "type": "text",
          "content": "Travel other asian countries adn live there adn let their culture seep into me and be offbeat preferably with a few friends(japan, china, vietnam) yk i wanna play different characters and just spawn anywhere and anybody’s story i wanna move like wit from cosmere"
        },
        {
          "type": "text",
          "content": "Live alongside mountains in india(in a hostel somewhere) with my mac and maybe some friends and build smth there with no care for money"
        },
        {
          "type": "text",
          "content": "Make flying orbs like in andor"
        },
        {
          "type": "text",
          "content": "make interfaces as ive said before physical compilers so to say that convert your intent to actual things. A  bunch of world models adn clubbed togeher to finally get smth at the end that can be manufactured adn follows physics."
        },
        {
          "type": "text",
          "content": "Will add things as i remember them so as you can see these are the aesthetics that i want"
        }
      ]
    },
    {
      "date": "3 jan, 2026",
      "date_slug": "3_jan_2026",
      "timestamp": "2026-02-02T10:34:20.279870",
      "content": [
        {
          "type": "text",
          "content": "Think legos factorio etc"
        },
        {
          "type": "text",
          "content": "This is claude’s summary for my idea and it looks good"
        },
        {
          "type": "text",
          "content": "So a bunch of world model interfaces clubbed together where at the last stage we have a 3d model/mesh that is 3d printable :D"
        },
        {
          "type": "text",
          "content": "meow typbeat"
        },
        {
          "type": "image",
          "src": "images/blog/3_jan_2026_kix.mfph.png"
        },
        {
          "type": "text",
          "content": "So first i think i should make some sort of canvas screenshots of which will be given to claude back adn forth also that canvas would then connect to opencad or smth after that a few checks and it will be 3d printable. The thing is tho that i dont have 3d printer but idt thats a problem need to just make it till second last step :D"
        },
        {
          "type": "text",
          "content": "Aight now one more thing need to study some system design for <redacted> before getting back to ts"
        }
      ]
    },
    {
      "date": "2 jan, 2026",
      "date_slug": "2_jan_2026",
      "timestamp": "2026-02-02T10:34:20.279862",
      "content": [
        {
          "type": "text",
          "content": "At my study table in home taking rahat ki saans while writing this."
        },
        {
          "type": "text",
          "content": "Seeing what my friends are upto and if its smth fun ill hop in and also do that thing. Basically resting while looking for my next sidequest."
        }
      ]
    },
    {
      "date": "1 jan, 2026",
      "date_slug": "1_jan_2026",
      "timestamp": "2026-02-02T10:34:20.279854",
      "content": [
        {
          "type": "text",
          "content": "Ok so last day was crazy I had fun more on ts later also exams fucking over and I'm heading back home rn in train listening to fade into you."
        }
      ]
    },
    {
      "date": "30 dec, 2025",
      "date_slug": "30_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279831",
      "content": [
        {
          "type": "text",
          "content": "I wanna feel like ts"
        },
        {
          "type": "text",
          "content": "[https://www.youtube.com/watch?v=B83B8W5G0Zk&list=RDB83B8W5G0Zk&start_radio=1](https://www.youtube.com/watch?v=B83B8W5G0Zk&list=RDB83B8W5G0Zk&start_radio=1)"
        },
        {
          "type": "text",
          "content": "In his zone flirting with the world itself"
        },
        {
          "type": "text",
          "content": "And the neat thing is that in other performances of his after this one got popular when he was just testing his mic and so the the echo the low guitar everything is pretty good almost which he cant do in his later performances cause hes too nervous it seems for chaiyaan"
        },
        {
          "type": "text",
          "content": "But for ts song [https://www.youtube.com/watch?v=RLhci-luGWE&list=RDB83B8W5G0Zk&index=6](https://www.youtube.com/watch?v=RLhci-luGWE&list=RDB83B8W5G0Zk&index=6)"
        },
        {
          "type": "text",
          "content": "He did perform pretty good and good throat vocals too on par"
        }
      ]
    },
    {
      "date": "29 dec, 2025",
      "date_slug": "29_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279770",
      "content": [
        {
          "type": "image",
          "src": "images/blog/29_dec_2025_kix.yw86.png"
        },
        {
          "type": "text",
          "content": "Btw strings.Fields(smth) splits into whitespaces"
        },
        {
          "type": "text",
          "content": "And strings.Split(smth, “,”)  // splits by ,"
        },
        {
          "type": "text",
          "content": "I was getting into system design and made a load balancer in go :D"
        },
        {
          "type": "text",
          "content": "I should work more this not cutting it"
        }
      ]
    },
    {
      "date": "25 dec, 2025",
      "date_slug": "25_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279760",
      "content": [
        {
          "type": "text",
          "content": "Studying system design nowadays also one thing is clear im starting running but eventually i wanna be able to run real fast like on athlete’s level yk i saw ts reel where the guy’s sweat was evaporating cause his body was so heated up adn it looked like a titan transforming :D"
        },
        {
          "type": "text",
          "content": "Sometimes i feel taking a piece of a life that i am capable but havent realised a life that could be taking a piece from that and integrating that into my present life and keep doing that until its fully integrated in my life."
        }
      ]
    },
    {
      "date": "23 dec, 2025",
      "date_slug": "23_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279750",
      "content": [
        {
          "type": "text",
          "content": "lock in"
        }
      ]
    },
    {
      "date": "22 dec, 2025",
      "date_slug": "22_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279740",
      "content": [
        {
          "type": "text",
          "content": "Man i wanna work on locally running models and that i feel is really important to me. Wdym i have to pay atleast 20 dollars a month to get access to intelligence adn not having that puts me at a disadvantage, its not really about money its about leverage liek how taht thing can be taken away from me on their whim."
        },
        {
          "type": "text",
          "content": "Anyways tomorrow i have an exam so i gotta study for that :D"
        }
      ]
    },
    {
      "date": "21 dec, 2025",
      "date_slug": "21_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279723",
      "content": [
        {
          "type": "text",
          "content": "I wanna drink smth warm should make myself smth tbh"
        },
        {
          "type": "text",
          "content": "Anyways woke up late today and the first thing that came to mind was that i need to build that autonomous drones orbs that can play music and have claude in it. That me and @arpitingle have been planning for sometime. But in this winter i should get my money affairs right or maybe should just get another intern, either way i should get my affairs in order that allows me to do what i want to do. :D"
        },
        {
          "type": "text",
          "content": "Summer is for getting the benefits of all teh work u did in winters and flowing but winters are for long hours of obsessive work."
        },
        {
          "type": "text",
          "content": "I must form a base below which i dont fall i need a magnanimous w or training that will act as a precursor to that w"
        },
        {
          "type": "text",
          "content": "So yeah form a baseline currently that is codeforces if i cant do anything then ill do codeforces"
        },
        {
          "type": "text",
          "content": "`"
        }
      ]
    },
    {
      "date": "20 dec, 2025",
      "date_slug": "20_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279686",
      "content": [
        {
          "type": "text",
          "content": "Hmm also once you’ve thought about what you want and are sure of it then getting it is the ez part yk, cause bending the world to your will is ez once you know what the shape you want it to take."
        },
        {
          "type": "text",
          "content": "(btw random book rec: the making of prince of persia)"
        },
        {
          "type": "text",
          "content": "So anyways first calibration is required and then after that its pretty ez cause you know what to optimise for."
        },
        {
          "type": "image",
          "src": "images/blog/20_dec_2025_kix.jc8u.png"
        }
      ]
    },
    {
      "date": "19 dec, 2025",
      "date_slug": "19_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279644",
      "content": [
        {
          "type": "text",
          "content": "Ok exam done"
        },
        {
          "type": "image",
          "src": "images/blog/19_dec_2025_kix.dtfk.png"
        },
        {
          "type": "text",
          "content": "Also heard in some gc that “no hymns chanted on hungry stomach”"
        },
        {
          "type": "text",
          "content": "Ts is so tru ong"
        },
        {
          "type": "text",
          "content": "Anyways i was studying and something obv to anyone studying cs would be that when we delete smth it doesnt aktually get deleted even after clearing bin cause the bits until occupied by smth else are still there for this tools do exist"
        },
        {
          "type": "text",
          "content": "Like shred on linux"
        },
        {
          "type": "text",
          "content": "But nothing on mac cause i mean i asked claude adn apparently there existed one but now there is no need as teh data is encrypted and once key is deleted no way to access that data not only that you could enable altho it should already be System Settings → Privacy & Security → FileVault"
        },
        {
          "type": "text",
          "content": "Also you cant aktually build this cause macs all use SSDs with wear leveling, so overwriting doesn't guarantee the data is actually erased from the physical flash cells"
        },
        {
          "type": "text",
          "content": "Oh also ts is the reason that your shred command is good in theory but wont work aktuallly in practice so yeah have fun :D"
        }
      ]
    },
    {
      "date": "17 dec, 2025",
      "date_slug": "17_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279635",
      "content": [
        {
          "type": "text",
          "content": "😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭"
        },
        {
          "type": "text",
          "content": "fuck everyone"
        }
      ]
    },
    {
      "date": "15 dec, 2025",
      "date_slug": "15_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279530",
      "content": [
        {
          "type": "text",
          "content": "Aight gave the exam now i have next 24 hours where i can go wild which i plan to do"
        },
        {
          "type": "text",
          "content": "The risks you take dont mean shit if you dont put the effort that goes with it"
        },
        {
          "type": "text",
          "content": "I must win"
        },
        {
          "type": "text",
          "content": "If you wanted it enough you’d have it"
        },
        {
          "type": "text",
          "content": "Aight but before that need to update my site to show that game of life cellular automate simulation in the background."
        },
        {
          "type": "text",
          "content": "Hey who wants to train models ;D   hmmmm 🤔"
        },
        {
          "type": "text",
          "content": "Anyways if you wanna start the first thing to know are these"
        },
        {
          "type": "text",
          "content": "1. FORWARD PASS │ │ Input → Model → Prediction"
        },
        {
          "type": "text",
          "content": "2. COMPUTE LOSS │ │ How wrong is the prediction?"
        },
        {
          "type": "text",
          "content": "3. BACKWARD PASS (Backpropagation) │ │ Compute gradients: ∂Loss/∂weights"
        },
        {
          "type": "text",
          "content": "4. UPDATE WEIGHTS │ │ weights -= learning_rate × gradient"
        },
        {
          "type": "text",
          "content": "5. REPEAT (thousands of times)"
        },
        {
          "type": "text",
          "content": "each run tthrough all of data is called an epoch"
        },
        {
          "type": "text",
          "content": "I want to write on my notebook sort of something not only write but also draw and have llms give only signal im not sure if it’ll be signal"
        },
        {
          "type": "text",
          "content": "the way i wanna interact with llms hasnt been built yet its just too limiting man my speed of thought is much greater but even if i come to its level i dont wanna act like a manager as well as a translator and text just isnt it why cant it draw with me"
        },
        {
          "type": "text",
          "content": "im not sure it can even be done with llms maybe smth new but i see smth and the closest approximation we have rn is claude which btw is also very very very far i see smth but im not sure how to make it its very very hard but i do see it"
        },
        {
          "type": "image",
          "src": "images/blog/15_dec_2025_kix.gyt7.png"
        },
        {
          "type": "text",
          "content": "one usecase forexample is imagine a paperliek tablet liek this which has ts texture where you can just draw diagrams could be anything could be system design could be cad adjacent could be just plain old drawings and then ai(not sure llms) can help with it and there's an interface 3d printer adjacent that this can interface with to build whatever you want ykwim things could be much much better and tightknit than it is now we are far from where it could feel magical and of actual utility"
        },
        {
          "type": "image",
          "src": "images/blog/15_dec_2025_kix.hocb.png"
        }
      ]
    },
    {
      "date": "14 dec, 2025",
      "date_slug": "14_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279460",
      "content": [
        {
          "type": "text",
          "content": "I tweeted about ts project that i worked on a few weeks ago i think i should also include it in the projects section here, weirdly thanks to ts project i now know quite a lot about resnets :D"
        },
        {
          "type": "text",
          "content": "[https://x.com/kucchi09/status/1999856795213582694](https://x.com/kucchi09/status/1999856795213582694)"
        },
        {
          "type": "text",
          "content": "Ts  was a particularly good experiment i need to do more such things"
        },
        {
          "type": "text",
          "content": "Also i had ts idea about flying orbs that i need to build with oomf need to research more on that and also find a way to moneymaxx cause these things require money. I want money to be disconnected from my work tbh anyways gotta go ciao"
        },
        {
          "type": "text",
          "content": "Also worst case scenario if i dont get any direction till jan first week then imma jsut reach cm on cf till mid late of 2026 which is still a colossal W so yeah i win either way its just a matter of how big :D"
        },
        {
          "type": "image",
          "src": "images/blog/14_dec_2025_kix.vjgg.png"
        },
        {
          "type": "text",
          "content": "Also random link [https://tokens-for-thoughts.notion.site/post-training-101](https://tokens-for-thoughts.notion.site/post-training-101)"
        },
        {
          "type": "text",
          "content": "Ill read ts eventually heh"
        },
        {
          "type": "text",
          "content": "One more thing which i plan to doing is giving every codeforces contest and also solve it to completion whatever theory is needed i must learn and look at editorials etc so  yeah basically learn everything i need to"
        },
        {
          "type": "text",
          "content": "Never ever miss a contest cause my brain has gotten rusty and requires some rigorous training"
        },
        {
          "type": "text",
          "content": "Whatever you do i hope you do it with the utmost sincerity and flow and also have fun while doing it :D"
        }
      ]
    },
    {
      "date": "13 dec, 2025",
      "date_slug": "13_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279444",
      "content": [
        {
          "type": "text",
          "content": "Also just saw this video"
        },
        {
          "type": "text",
          "content": "[https://x.com/KrishRShah/status/1999576120878883287?s=20](https://x.com/KrishRShah/status/1999576120878883287?s=20)"
        },
        {
          "type": "text",
          "content": "This is so cool ohmygod also this guy iirc also built weighing machine but using trackpad so goated yep i was right here it is [https://x.com/KrishRShah/status/1947186835811193330?s=20](https://x.com/KrishRShah/status/1947186835811193330?s=20)"
        },
        {
          "type": "text",
          "content": "I found it very cool when i saw this but now that i have a mac im actually gonna try both of these out :D"
        }
      ]
    },
    {
      "date": "12 dec, 2025",
      "date_slug": "12_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279417",
      "content": [
        {
          "type": "text",
          "content": "First i will solve 2 aoc problems cause gotta catch up after that will do some research on nn algos for market prediction, i do have a few repos that i will see to see whats up one of them is [https://github.com/Sudhanshu-S3/Live-Strategy-Backtester-II](https://github.com/Sudhanshu-S3/Live-Strategy-Backtester-II)  from this i wanna see how to interface with teh market to get data and will take a look at the design of ts project."
        },
        {
          "type": "text",
          "content": "And then need to study some for my finals :(  anyways for my decisions to make sense imma have to overwork everyone else lessgetoit :D"
        },
        {
          "type": "text",
          "content": "There should be ts innate sense of that im getting better yk i need to move fast real fast"
        },
        {
          "type": "text",
          "content": "Oh btw update: i did 3 aoc and yes did study the repo too more on this later"
        },
        {
          "type": "text",
          "content": "Also i might go on a lil hiatus due to finals but yeah will try to keep updating"
        },
        {
          "type": "text",
          "content": "One thing i wanna do in my life is iceskating i have a feeling once i get the hang of it ill be really good at it :D"
        },
        {
          "type": "text",
          "content": "I need to do more"
        }
      ]
    },
    {
      "date": "11 dec, 2025",
      "date_slug": "11_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279320",
      "content": [
        {
          "type": "text",
          "content": "anyways what imma do now today is study algos and implement them this is the winter imma consume more info than anyone ever and imma absorb it also :D"
        },
        {
          "type": "text",
          "content": "so yeah first thing i was thinking is can we train neural nets to predict markets? idk will have to find out :D"
        },
        {
          "type": "text",
          "content": "chasing an aesthetic that is particularly mine ;D"
        },
        {
          "type": "image",
          "src": "images/blog/11_dec_2025_kix.waps.png"
        }
      ]
    },
    {
      "date": "10 dec, 2025",
      "date_slug": "10_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279311",
      "content": [
        {
          "type": "text",
          "content": "rejected a semidecent intern offer cause i didnt feel like doing it i could tell that this was not my path :D"
        }
      ]
    },
    {
      "date": "10 jab, 2026",
      "date_slug": "10_jab_2026",
      "timestamp": "2026-02-02T10:34:20.280192",
      "content": [
        {
          "type": "text",
          "content": "hi, added a few more features to canvas like exporting stl and multiturn."
        },
        {
          "type": "text",
          "content": "so I have smth in mind let's say how do I losslessly iterate on that canvas and have control over complex models."
        },
        {
          "type": "text",
          "content": "let's say if i give it a batman logo it should be able to create a model of it. It should be able to break it into several parts so that model of that could be created."
        },
        {
          "type": "text",
          "content": "So we can see several models clubbed together to make that and then yk we will 3d print them one by one and then join them."
        },
        {
          "type": "text",
          "content": "Hmm but how will it break it into parts that software needs to be created. Look at it like this first we need some intermediary of our sketch smth not as bad as sketch but not as fixed as the final code. Smth in between which we will break into several parts iykwim. So we will go through that intermediary and as soon as it gets complex break it away. Smth like that."
        },
        {
          "type": "text",
          "content": "[https://canvas-flax-five.vercel.app/](https://canvas-flax-five.vercel.app/)  // here is the thing im talking about have fun :D"
        }
      ]
    },
    {
      "date": "9 dec, 2025",
      "date_slug": "9_dec_2025",
      "timestamp": "2026-02-02T10:34:20.279276",
      "content": [
        {
          "type": "text",
          "content": "toh i was thinking what should the current aesthetic i should be chasing be"
        },
        {
          "type": "text",
          "content": "currently i saw this reel about training a neural network to predict markets and my next arc is going deep in algos and modelling(as well as visualisation) so codeforces and ml sounds but in a more aristocratic way there isnt an end goal its just to train my mind and gain more knowledge and pure learning :D"
        },
        {
          "type": "text",
          "content": "i wanna make ervrtything"
        },
        {
          "type": "text",
          "content": "training arc i wanna train my body to move like achilles and i want to be more chill and want things in control, its time again to see that outer things dont really matter its the inside things"
        },
        {
          "type": "text",
          "content": "the greatest thing you ever worked on should still be yourself i think i should move in a way that the byproduct of that existence are peak things"
        }
      ]
    }
  ],
  "last_updated": "2026-02-02T10:34:20.296714"
}