{
  "entries": [
    {
      "date": "25 dec, 2025",
      "date_slug": "25_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027583",
      "content": [
        {
          "type": "text",
          "content": "Studying system design nowadays also one thing is clear im starting running but eventually i wanna be able to run real fast like on athlete’s level yk i saw ts reel where the guy’s sweat was evaporating cause his body was so heated up adn it looked like a titan transforming :D"
        },
        {
          "type": "text",
          "content": "Sometimes i feel taking a piece of a life that i am capable but havent realised a life that could be taking a piece from that and integrating that into my present life and keep doing that until its fully integrated in my life."
        }
      ]
    },
    {
      "date": "23 dec, 2025",
      "date_slug": "23_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027576",
      "content": [
        {
          "type": "text",
          "content": "lock in"
        }
      ]
    },
    {
      "date": "22 dec, 2025",
      "date_slug": "22_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027566",
      "content": [
        {
          "type": "text",
          "content": "Man i wanna work on locally running models and that i feel is really important to me. Wdym i have to pay atleast 20 dollars a month to get access to intelligence adn not having that puts me at a disadvantage, its not really about money its about leverage liek how taht thing can be taken away from me on their whim."
        },
        {
          "type": "text",
          "content": "Anyways tomorrow i have an exam so i gotta study for that :D"
        }
      ]
    },
    {
      "date": "21 dec, 2025",
      "date_slug": "21_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027548",
      "content": [
        {
          "type": "text",
          "content": "I wanna drink smth warm should make myself smth tbh"
        },
        {
          "type": "text",
          "content": "Anyways woke up late today and the first thing that came to mind was that i need to build that autonomous drones orbs that can play music and have claude in it. That me and @arpitingle have been planning for sometime. But in this winter i should get my money affairs right or maybe should just get another intern, either way i should get my affairs in order that allows me to do what i want to do. :D"
        },
        {
          "type": "text",
          "content": "Summer is for getting the benefits of all teh work u did in winters and flowing but winters are for long hours of obsessive work."
        },
        {
          "type": "text",
          "content": "I must form a base below which i dont fall i need a magnanimous w or training that will act as a precursor to that w"
        },
        {
          "type": "text",
          "content": "So yeah form a baseline currently that is codeforces if i cant do anything then ill do codeforces"
        },
        {
          "type": "text",
          "content": "`"
        }
      ]
    },
    {
      "date": "20 dec, 2025",
      "date_slug": "20_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027513",
      "content": [
        {
          "type": "text",
          "content": "Hmm also once you’ve thought about what you want and are sure of it then getting it is the ez part yk, cause bending the world to your will is ez once you know what the shape you want it to take."
        },
        {
          "type": "text",
          "content": "(btw random book rec: the making of prince of persia)"
        },
        {
          "type": "text",
          "content": "So anyways first calibration is required and then after that its pretty ez cause you know what to optimise for."
        },
        {
          "type": "image",
          "src": "images/blog/20_dec_2025_kix.jc8u.png"
        }
      ]
    },
    {
      "date": "19 dec, 2025",
      "date_slug": "19_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027472",
      "content": [
        {
          "type": "text",
          "content": "Ok exam done"
        },
        {
          "type": "image",
          "src": "images/blog/19_dec_2025_kix.dtfk.png"
        },
        {
          "type": "text",
          "content": "Also heard in some gc that “no hymns chanted on hungry stomach”"
        },
        {
          "type": "text",
          "content": "Ts is so tru ong"
        },
        {
          "type": "text",
          "content": "Anyways i was studying and something obv to anyone studying cs would be that when we delete smth it doesnt aktually get deleted even after clearing bin cause the bits until occupied by smth else are still there for this tools do exist"
        },
        {
          "type": "text",
          "content": "Like shred on linux"
        },
        {
          "type": "text",
          "content": "But nothing on mac cause i mean i asked claude adn apparently there existed one but now there is no need as teh data is encrypted and once key is deleted no way to access that data not only that you could enable altho it should already be System Settings → Privacy & Security → FileVault"
        },
        {
          "type": "text",
          "content": "Also you cant aktually build this cause macs all use SSDs with wear leveling, so overwriting doesn't guarantee the data is actually erased from the physical flash cells"
        },
        {
          "type": "text",
          "content": "Oh also ts is the reason that your shred command is good in theory but wont work aktuallly in practice so yeah have fun :D"
        }
      ]
    },
    {
      "date": "17 dec, 2025",
      "date_slug": "17_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027462",
      "content": [
        {
          "type": "text",
          "content": "😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭"
        },
        {
          "type": "text",
          "content": "fuck everyone"
        }
      ]
    },
    {
      "date": "15 dec, 2025",
      "date_slug": "15_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027369",
      "content": [
        {
          "type": "text",
          "content": "Aight gave the exam now i have next 24 hours where i can go wild which i plan to do"
        },
        {
          "type": "text",
          "content": "The risks you take dont mean shit if you dont put the effort that goes with it"
        },
        {
          "type": "text",
          "content": "I must win"
        },
        {
          "type": "text",
          "content": "If you wanted it enough you’d have it"
        },
        {
          "type": "text",
          "content": "Aight but before that need to update my site to show that game of life cellular automate simulation in the background."
        },
        {
          "type": "text",
          "content": "Hey who wants to train models ;D   hmmmm 🤔"
        },
        {
          "type": "text",
          "content": "Anyways if you wanna start the first thing to know are these"
        },
        {
          "type": "text",
          "content": "1. FORWARD PASS │ │ Input → Model → Prediction"
        },
        {
          "type": "text",
          "content": "2. COMPUTE LOSS │ │ How wrong is the prediction?"
        },
        {
          "type": "text",
          "content": "3. BACKWARD PASS (Backpropagation) │ │ Compute gradients: ∂Loss/∂weights"
        },
        {
          "type": "text",
          "content": "4. UPDATE WEIGHTS │ │ weights -= learning_rate × gradient"
        },
        {
          "type": "text",
          "content": "5. REPEAT (thousands of times)"
        },
        {
          "type": "text",
          "content": "each run tthrough all of data is called an epoch"
        },
        {
          "type": "text",
          "content": "I want to write on my notebook sort of something not only write but also draw and have llms give only signal im not sure if it’ll be signal"
        },
        {
          "type": "text",
          "content": "the way i wanna interact with llms hasnt been built yet its just too limiting man my speed of thought is much greater but even if i come to its level i dont wanna act like a manager as well as a translator and text just isnt it why cant it draw with me"
        },
        {
          "type": "text",
          "content": "im not sure it can even be done with llms maybe smth new but i see smth and the closest approximation we have rn is claude which btw is also very very very far i see smth but im not sure how to make it its very very hard but i do see it"
        },
        {
          "type": "image",
          "src": "images/blog/15_dec_2025_kix.gyt7.png"
        },
        {
          "type": "text",
          "content": "one usecase forexample is imagine a paperliek tablet liek this which has ts texture where you can just draw diagrams could be anything could be system design could be cad adjacent could be just plain old drawings and then ai(not sure llms) can help with it and there's an interface 3d printer adjacent that this can interface with to build whatever you want ykwim things could be much much better and tightknit than it is now we are far from where it could feel magical and of actual utility"
        },
        {
          "type": "image",
          "src": "images/blog/15_dec_2025_kix.hocb.png"
        }
      ]
    },
    {
      "date": "14 dec, 2025",
      "date_slug": "14_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027307",
      "content": [
        {
          "type": "text",
          "content": "I tweeted about ts project that i worked on a few weeks ago i think i should also include it in the projects section here, weirdly thanks to ts project i now know quite a lot about resnets :D"
        },
        {
          "type": "text",
          "content": "[https://x.com/kucchi09/status/1999856795213582694](https://x.com/kucchi09/status/1999856795213582694)"
        },
        {
          "type": "text",
          "content": "Ts  was a particularly good experiment i need to do more such things"
        },
        {
          "type": "text",
          "content": "Also i had ts idea about flying orbs that i need to build with oomf need to research more on that and also find a way to moneymaxx cause these things require money. I want money to be disconnected from my work tbh anyways gotta go ciao"
        },
        {
          "type": "text",
          "content": "Also worst case scenario if i dont get any direction till jan first week then imma jsut reach cm on cf till mid late of 2026 which is still a colossal W so yeah i win either way its just a matter of how big :D"
        },
        {
          "type": "image",
          "src": "images/blog/14_dec_2025_kix.vjgg.png"
        },
        {
          "type": "text",
          "content": "Also random link [https://tokens-for-thoughts.notion.site/post-training-101](https://tokens-for-thoughts.notion.site/post-training-101)"
        },
        {
          "type": "text",
          "content": "Ill read ts eventually heh"
        },
        {
          "type": "text",
          "content": "One more thing which i plan to doing is giving every codeforces contest and also solve it to completion whatever theory is needed i must learn and look at editorials etc so  yeah basically learn everything i need to"
        },
        {
          "type": "text",
          "content": "Never ever miss a contest cause my brain has gotten rusty and requires some rigorous training"
        },
        {
          "type": "text",
          "content": "Whatever you do i hope you do it with the utmost sincerity and flow and also have fun while doing it :D"
        }
      ]
    },
    {
      "date": "13 dec, 2025",
      "date_slug": "13_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027291",
      "content": [
        {
          "type": "text",
          "content": "Also just saw this video"
        },
        {
          "type": "text",
          "content": "[https://x.com/KrishRShah/status/1999576120878883287?s=20](https://x.com/KrishRShah/status/1999576120878883287?s=20)"
        },
        {
          "type": "text",
          "content": "This is so cool ohmygod also this guy iirc also built weighing machine but using trackpad so goated yep i was right here it is [https://x.com/KrishRShah/status/1947186835811193330?s=20](https://x.com/KrishRShah/status/1947186835811193330?s=20)"
        },
        {
          "type": "text",
          "content": "I found it very cool when i saw this but now that i have a mac im actually gonna try both of these out :D"
        }
      ]
    },
    {
      "date": "12 dec, 2025",
      "date_slug": "12_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027262",
      "content": [
        {
          "type": "text",
          "content": "First i will solve 2 aoc problems cause gotta catch up after that will do some research on nn algos for market prediction, i do have a few repos that i will see to see whats up one of them is [https://github.com/Sudhanshu-S3/Live-Strategy-Backtester-II](https://github.com/Sudhanshu-S3/Live-Strategy-Backtester-II)  from this i wanna see how to interface with teh market to get data and will take a look at the design of ts project."
        },
        {
          "type": "text",
          "content": "And then need to study some for my finals :(  anyways for my decisions to make sense imma have to overwork everyone else lessgetoit :D"
        },
        {
          "type": "text",
          "content": "There should be ts innate sense of that im getting better yk i need to move fast real fast"
        },
        {
          "type": "text",
          "content": "Oh btw update: i did 3 aoc and yes did study the repo too more on this later"
        },
        {
          "type": "text",
          "content": "Also i might go on a lil hiatus due to finals but yeah will try to keep updating"
        },
        {
          "type": "text",
          "content": "One thing i wanna do in my life is iceskating i have a feeling once i get the hang of it ill be really good at it :D"
        },
        {
          "type": "text",
          "content": "I need to do more"
        }
      ]
    },
    {
      "date": "11 dec, 2025",
      "date_slug": "11_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027147",
      "content": [
        {
          "type": "text",
          "content": "anyways what imma do now today is study algos and implement them this is the winter imma consume more info than anyone ever and imma absorb it also :D"
        },
        {
          "type": "text",
          "content": "so yeah first thing i was thinking is can we train neural nets to predict markets? idk will have to find out :D"
        },
        {
          "type": "text",
          "content": "chasing an aesthetic that is particularly mine ;D"
        },
        {
          "type": "image",
          "src": "images/blog/11_dec_2025_kix.waps.png"
        }
      ]
    },
    {
      "date": "10 dec, 2025",
      "date_slug": "10_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027138",
      "content": [
        {
          "type": "text",
          "content": "rejected a semidecent intern offer cause i didnt feel like doing it i could tell that this was not my path :D"
        }
      ]
    },
    {
      "date": "9 dec, 2025",
      "date_slug": "9_dec_2025",
      "timestamp": "2025-12-26T20:12:48.027103",
      "content": [
        {
          "type": "text",
          "content": "toh i was thinking what should the current aesthetic i should be chasing be"
        },
        {
          "type": "text",
          "content": "currently i saw this reel about training a neural network to predict markets and my next arc is going deep in algos and modelling(as well as visualisation) so codeforces and ml sounds but in a more aristocratic way there isnt an end goal its just to train my mind and gain more knowledge and pure learning :D"
        },
        {
          "type": "text",
          "content": "i wanna make ervrtything"
        },
        {
          "type": "text",
          "content": "training arc i wanna train my body to move like achilles and i want to be more chill and want things in control, its time again to see that outer things dont really matter its the inside things"
        },
        {
          "type": "text",
          "content": "the greatest thing you ever worked on should still be yourself i think i should move in a way that the byproduct of that existence are peak things"
        }
      ]
    }
  ],
  "last_updated": "2025-12-26T20:12:48.040807"
}